{
  "title": "Shopping Assistant Application",
  "summary": "This is a Flask-based web application that serves as an Amazon shopping assistant, using Selenium for web scraping and a Large Language Model (LLM) client for natural language processing. <br><br>The application can search for products on Amazon, provide product details, and assist in adding items to the cart based on user input.",
  "projectImage": "amazon.png",
  "githubLink": "https://github.com/Vijeth-Rai/Chatbot-that-can-place-Amazon-orders-for-you",
  "contentSections": [
    [
       
      {
        "type": "text-left",
        "header": "1. Search for Products Like a Pro",
        "text": "Imagine you’re looking for a toy on Amazon. You can just tell the shopping assistant what you want, and it will find the top 5 toys for you! It’s like having a magical helper that knows where to look."
      },
      {
        "type": "text-right",
        "header": "3. Pick the Best One",
        "text": "The shopping assistant doesn’t just find things; it also helps you choose the best one! If you’re unsure which toy to pick, it will suggest the best one and even tell you why it’s the best. It's like having a friend who’s really good at shopping."
      }
    ],
  [
    {
      "type": "text-left",
      "header": "2. Add to Cart for You",
      "text": "Once you’ve decided which toy you want, the assistant can put it in your cart for you. No need to click around – it does the work for you! Just like having a robot that knows exactly what you want to buy."
    },
    {
      "type": "text-right",
      "header": "4. Chat with the Assistant",
      "text": "You can talk to the shopping assistant like you talk to a person. Ask it questions, tell it what you’re looking for, and it will chat back with you to help you find what you need. It’s like having a friendly conversation while shopping."
    }
  ],
  [
    {
    "type": "text-full",
    "header": "Application Overview",
    "text": ""
  }
  ],
  [
    {
    "type": "text-left",
    "header": "Flask Application (app.py):",
    "text": "<ul><li>Serves as the backend server.</li><br><li>Routes incoming requests to the appropriate handler functions.</li><br><li>Handles communication between the user and the shopping assistant logic.</li></ul>"
  },
  {
    "type": "text-right",
    "header": "Selenium WebDriver:",
    "text": "<ul><li>Used for scraping Amazon's website to retrieve product information.</li><br><li>Configured to run in headless mode to simulate user interactions without a visible browser window.</li></ul>"
  }
  ],
  [
    {
    "type": "text-left",
    "header": "Shopping Assistant:",
    "text": "<ul><li>Handles the core logic for product searching, selection, and adding items to the cart.</li><br><li>Interacts with the LLM client for processing user inputs and generating responses</li></ul>"
  },
  {
    "type": "text-right",
    "header": "LLM Client (Groq):",
    "text": "<ul><li>A language model API client used for processing natural language queries and generating context-aware responses.</li></ul>"
  }
  ],
  [
    {
      "type": "text-full",
      "header": "Key Functions",
      "text": "<ul><li><strong>load_driver():</strong> Initializes and configures the Selenium WebDriver with the necessary options and settings to bypass bot detection mechanisms on websites like Amazon.</li><br><li><strong>get_product_info(product_name):</strong> Searches Amazon for the specified product and returns a list of the top 5 matching products along with their prices.</li><br><li><strong>get_ai_response(messages):</strong> Interacts with the LLM to generate a response based on the given chat messages.</li><br><li><strong>is_product(message):</strong> Determines if the user's message is related to browsing or purchasing a product.</li><br><li><strong>extract_search(message):</strong> Extracts the search query from the user's message to search for products on Amazon.</li><br><li><strong>add_to_cart(index):</strong> Adds the selected product to the Amazon cart based on the index provided.</li><br><li><strong>handle_message(message):</strong> Main function to handle user messages and generate appropriate responses, either by querying the LLM or interacting with Amazon's website.</li></ul>"
    }
  ],
  [
    {
      "type": "text-left",
      "header": "Environment Variables",
      "text": "<ul><li><strong>GROQ_API_KEY:</strong> API key for accessing the Groq language model API</li><br><li><strong>CHROMEDRIVER_PATH:</strong>(Optional) Path to the ChromeDriver executable, if not using webdriver_manager for automatic installation.</li></ul>"
    },
    {
      "type": "text-right",
      "header": "Technologies Used",
      "text": "<ul><li><strong>Flask:</strong> A lightweight WSGI web application framework in Python.</li><br><li><strong>Selenium:</strong> A web automation tool used for scraping and interacting with websites.</li><br><li><strong>Groq API:</strong> An API for interacting with a large language model for natural language processing.</li><br><li><strong>Python:</strong> The programming language used to develop the application."
    }
  ]
  ]
}
